# Taps
tap 'homebrew/cask'

# Formulas
brew 'colima'
brew 'coreutils'
brew 'docker-compose'
brew 'docker'
brew 'duckdb'
brew 'git'
brew 'go'
brew 'jq'
brew 'mas'
brew 'maven'
brew 'openjdk'
brew 'parquet-cli'
brew 'pipenv'
brew 'pyenv'
brew 'sbt'
brew 'scala'
brew 'tree'
brew 'wget'
brew 'yq'

# Casks
cask '1password'
cask 'authy'
cask 'firefox'
cask 'google-chrome'
cask 'iterm2'
cask 'postman'
cask 'slack'
cask 'tableplus'
cask 'visual-studio-code'

# Fun and creativity
cask 'adobe-creative-cloud'
cask 'adobe-digital-editions'
cask 'spotify'
cask 'steam'
cask 'zwift'

# App Store items
mas 'Magnet', id: 441258766
