# Taps
tap 'heroku/brew'
tap 'homebrew/cask'

# Formulas
brew 'awscli'
brew 'coreutils'
brew 'git'
brew 'go'
brew 'heroku'
brew 'jq'
brew 'mas'
brew 'maven'
brew 'openjdk'
brew 'parquet-tools'
brew 'pipenv'
brew 'pyenv'
brew 'sbt'
brew 'scala'
brew 'tree'
brew 'wget'
brew 'yq'

# Casks
cask '1password'
cask 'atom'
cask 'authy'
cask 'cheatsheet'
cask 'docker'
cask 'google-chrome'
cask 'gpg-suite-no-mail'
cask 'iterm2'
cask 'lastpass'
cask 'postgres'
cask 'postman'
cask 'slack'
cask 'spotify'
cask 'tableplus'
cask 'visual-studio-code'

# App Store items
mas 'Magnet', id: 441258766

# Games and creativity
cask 'adobe-creative-cloud'
cask 'zwift'
