# Formulas
brew 'colima'
brew 'coreutils'
brew 'docker'
brew 'docker-buildx'
brew 'docker-compose'
brew 'duckdb'
brew 'fd'
brew 'fzf'
brew 'gemini-cli'
brew 'git'
brew 'go'
brew 'jq'
brew 'mas'
brew 'nvim'
brew 'opencode'
brew 'parquet-cli'
brew 'ripgrep'
brew 'tree'
brew 'uv'
brew 'wget'
brew 'yq'

# Casks
cask '1password'
cask 'codex'
cask 'codex-app'
cask 'firefox'
cask 'ghostty'
cask 'google-chrome'
cask 'macfuse'
cask 'postman'
cask 'slack'
cask 'veracrypt'
cask 'visual-studio-code'
cask 'warp'

# Fun and creativity
cask 'adobe-creative-cloud'
cask 'adobe-digital-editions'
cask 'calibre'
cask 'spotify'
cask 'steam'
cask 'zwift'

# App Store items
mas 'Magnet', id: 441258766
